Revit 2027 API
Application.ImportIFCCategoryTable Property
 Full path to the file that defines IFC entity to Revit category mappings for IFC import.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ImportIFCCategoryTable { get; }
Public ReadOnly Property ImportIFCCategoryTable As String
	Get
public:
property String^ ImportIFCCategoryTable {
	String^ get ();
}
member ImportIFCCategoryTable : string with get
Property Value
String
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace